# Data Preprocessing

In [29]:
# import python libraries
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import LabelEncoder

In [4]:
# load csvfile 
df = pd.read_csv('tested.csv' , encoding = 'unicode_escape')

In [5]:
df.shape

(418, 12)

In [6]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
5,897,0,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
6,898,1,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
7,899,0,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S
8,900,1,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,NaN,C
9,901,0,3,"Davies, Mr. John Samuel",male,21.0,2,0,A/4 48871,24.1500,NaN,S

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [8]:
# Drop less values column 
df.drop(['Cabin'], axis=1, inplace=True)

In [14]:
# columns name 
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Embarked'],
      dtype='object')

In [15]:
# check the null values
pd.isnull(df)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
413,False,False,False,False,False,True,False,False,False,False,False
414,False,False,False,False,False,False,False,False,False,False,False
415,False,False,False,False,False,False,False,False,False,False,False
416,False,False,False,False,False,True,False,False,False,False,False
417,False,False,False,False,False,True,False,False,False,False,False

In [16]:
# sum of null values in differnet columns 
pd.isnull(df).sum()

PassengerId     0
Survived        0
Pclass          0
Name            0
Sex             0
Age            86
SibSp           0
Parch           0
Ticket          0
Fare            1
Embarked        0
dtype: int64

In [17]:
# Drop null values
df.dropna(inplace=True)

In [18]:
pd.isnull(df).sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [19]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 331 entries, 0 to 415
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  331 non-null    int64
 1   Survived     331 non-null    int64
 2   Pclass       331 non-null    int64
 3   Name         331 non-null    object
 4   Sex          331 non-null    object
 5   Age          331 non-null    float64
 6   SibSp        331 non-null    int64
 7   Parch        331 non-null    int64
 8   Ticket       331 non-null    object
 9   Fare         331 non-null    float64
 10  Embarked     331 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 31.0+ KB

Here we see that the Age column values float values available
now we change the datatype of Age Column

In [21]:
# change data type of Age Column
df['Age'] = df['Age'].astype('int')

In [24]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,0,3,"Kelly, Mr. James",male,34,0,0,330911,7.8292,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47,1,0,363272,7.0000,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62,0,0,240276,9.6875,Q
3,895,0,3,"Wirz, Mr. Albert",male,27,0,0,315154,8.6625,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22,1,1,3101298,12.2875,S
5,897,0,3,"Svensson, Mr. Johan Cervin",male,14,0,0,7538,9.2250,S
6,898,1,3,"Connolly, Miss. Kate",female,30,0,0,330972,7.6292,Q
7,899,0,2,"Caldwell, Mr. Albert Francis",male,26,1,1,248738,29.0000,S
8,900,1,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18,0,0,2657,7.2292,C
9,901,0,3,"Davies, Mr. John Samuel",male,21,2,0,A/4 48871,24.1500,S

In [26]:
df['Age'].dtype

dtype('int32')

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 331 entries, 0 to 415
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  331 non-null    int64
 1   Survived     331 non-null    int64
 2   Pclass       331 non-null    int64
 3   Name         331 non-null    object
 4   Sex          331 non-null    object
 5   Age          331 non-null    int32
 6   SibSp        331 non-null    int64
 7   Parch        331 non-null    int64
 8   Ticket       331 non-null    object
 9   Fare         331 non-null    float64
 10  Embarked     331 non-null    object
dtypes: float64(1), int32(1), int64(5), object(4)
memory usage: 29.7+ KB

In [30]:
# Encode categorical variables (Sex and Embarked columns)
label_encoder = LabelEncoder()
df['Sex'] = label_encoder.fit_transform(df['Sex'])
df['Embarked'] = label_encoder.fit_transform(df['Embarked'])

In [31]:
# Split the data into features (X) and the target variable (y)
X = df.drop(columns=['Survived', 'Name', 'Ticket'])  # Exclude non-numeric columns and the target variable
y = df['Survived']

In [32]:
# Split the data into training and testing sets (e.g., 80% for training, 20% for testing)
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

# Choose a Machine Learning Algorithm

In [33]:
from sklearn.ensemble import RandomForestClassifier

In [34]:
# Initialize the model
model = RandomForestClassifier(n_estimators=100, random_state=42)

In [54]:
# Train the model on the training data
model.fit(X_train, y_train)

RandomForestClassifier(random_state=42)

# Model Evaluation

In [36]:
from sklearn.metrics import accuracy_score, classification_report

In [37]:
# Make predictions on the test data
y_pred = model.predict(X_test)

In [38]:
# Calculate accuracy
accuracy = accuracy_score(y_test, y_pred)
print(f'Accuracy: {accuracy:.2f}')

Accuracy: 1.00

In [39]:
# Display a classification report with precision, recall, and F1-score
print(classification_report(y_test, y_pred))

              precision    recall  f1-score   support

           0       1.00      1.00      1.00        45
           1       1.00      1.00      1.00        22

    accuracy                           1.00        67
   macro avg       1.00      1.00      1.00        67
weighted avg       1.00      1.00      1.00        67

# Making Predictions

In [51]:
# Create a new passenger's data (including a placeholder 'PassengerId')
new_passenger = pd.DataFrame({
    'PassengerId': [0],  # Placeholder value
    'Pclass': [3],
    'Sex': [1],  # 1 for female, 0 for male
    'Age': [25],
    'SibSp': [0],
    'Parch': [0],
    'Fare': [10],
    'Embarked': [2]  # 2 for 'Q'
})

In [52]:
# Reorder the columns to match the order seen during training
new_passenger = new_passenger[X_train.columns]

In [53]:
# Make a prediction
prediction = model.predict(new_passenger)
print(f'Predicted Survival: {"Survived" if prediction[0] == 1 else "Did not survive"}')

Predicted Survival: Did not survive

# Conclusion

In conclusion, a RandomForestClassifier machine learning model was successfully trained and evaluated 
using the Titanic dataset to predict passenger survival, achieving a certain level of accuracy.